virtualabs/cutcutgo/src/packs/ATSAMA5D27CLD2G_DFP/pio/sama5d27cld2g.h
/* ========== PIO definition for ADC peripheral ========== */
#define PIN_PD19X1_ADC_AD0                         _L_(115)     /**< ADC signal: ADC_AD0 on PD19 mux X1 */
#define PIO_PD19X1_ADC_AD0                         (_U_(1) << 19) /**< ADC signal: ADC_AD0 */
#define PIN_PD20X1_ADC_AD1                         _L_(116)     /**< ADC signal: ADC_AD1 on PD20 mux X1 */
#define PIO_PD20X1_ADC_AD1                         (_U_(1) << 20) /**< ADC signal: ADC_AD1 */
#define PIN_PD21X1_ADC_AD2                         _L_(117)     /**< ADC signal: ADC_AD2 on PD21 mux X1 */
#define PIO_PD21X1_ADC_AD2                         (_U_(1) << 21) /**< ADC signal: ADC_AD2 */
#define PIN_PD22X1_ADC_AD3                         _L_(118)     /**< ADC signal: ADC_AD3 on PD22 mux X1 */
#define PIO_PD22X1_ADC_AD3                         (_U_(1) << 22) /**< ADC signal: ADC_AD3 */
#define PIN_PD23X1_ADC_AD4                         _L_(119)     /**< ADC signal: ADC_AD4 on PD23 mux X1 */
#define PIO_PD23X1_ADC_AD4                         (_U_(1) << 23) /**< ADC signal: ADC_AD4 */
#define PIN_PD24X1_ADC_AD5                         _L_(120)     /**< ADC signal: ADC_AD5 on PD24 mux X1 */
#define PIO_PD24X1_ADC_AD5                         (_U_(1) << 24) /**< ADC signal: ADC_AD5 */
#define PIN_PD25X1_ADC_AD6                         _L_(121)     /**< ADC signal: ADC_AD6 on PD25 mux X1 */
#define PIO_PD25X1_ADC_AD6                         (_U_(1) << 25) /**< ADC signal: ADC_AD6 */
#define PIN_PD26X1_ADC_AD7                         _L_(122)     /**< ADC signal: ADC_AD7 on PD26 mux X1 */
#define PIO_PD26X1_ADC_AD7                         (_U_(1) << 26) /**< ADC signal: ADC_AD7 */
#define PIN_PD27X1_ADC_AD8                         _L_(123)     /**< ADC signal: ADC_AD8 on PD27 mux X1 */
#define PIO_PD27X1_ADC_AD8                         (_U_(1) << 27) /**< ADC signal: ADC_AD8 */
#define PIN_PD28X1_ADC_AD9                         _L_(124)     /**< ADC signal: ADC_AD9 on PD28 mux X1 */
#define PIO_PD28X1_ADC_AD9                         (_U_(1) << 28) /**< ADC signal: ADC_AD9 */
#define PIN_PD29X1_ADC_AD10                        _L_(125)     /**< ADC signal: ADC_AD10 on PD29 mux X1 */
#define PIO_PD29X1_ADC_AD10                        (_U_(1) << 29) /**< ADC signal: ADC_AD10 */
#define PIN_PD30X1_ADC_AD11                        _L_(126)     /**< ADC signal: ADC_AD11 on PD30 mux X1 */
#define PIO_PD30X1_ADC_AD11                        (_U_(1) << 30) /**< ADC signal: ADC_AD11 */
#define PIN_PD31A_ADC_ADTRG                        _L_(127)     /**< ADC signal: ADC_ADTRG on PD31 mux A */
#define MUX_PD31A_ADC_ADTRG                        _L_(0)       /**< ADC signal line function value: ADC_ADTRG */
#define PIO_PD31A_ADC_ADTRG                        (_U_(1) << 31) /**< ADC signal: ADC_ADTRG */
/* ========== PIO definition for AIC peripheral ========== */
#define PIN_PA12B_AIC_IRQ                          _L_(12)      /**< AIC signal: AIC_IRQ on PA12 mux B */
#define MUX_PA12B_AIC_IRQ                          _L_(1)       /**< AIC signal line function value: AIC_IRQ */
#define PIO_PA12B_AIC_IRQ                          (_U_(1) << 12) /**< AIC signal: AIC_IRQ */
#define PIN_PA21A_AIC_IRQ                          _L_(21)      /**< AIC signal: AIC_IRQ on PA21 mux A */
#define MUX_PA21A_AIC_IRQ                          _L_(0)       /**< AIC signal line function value: AIC_IRQ */
#define PIO_PA21A_AIC_IRQ                          (_U_(1) << 21) /**< AIC signal: AIC_IRQ */
#define PIN_PB3C_AIC_IRQ                           _L_(35)      /**< AIC signal: AIC_IRQ on PB3 mux C */
#define MUX_PB3C_AIC_IRQ                           _L_(2)       /**< AIC signal line function value: AIC_IRQ */
#define PIO_PB3C_AIC_IRQ                           (_U_(1) << 3) /**< AIC signal: AIC_IRQ */
#define PIN_PD31C_AIC_IRQ                          _L_(127)     /**< AIC signal: AIC_IRQ on PD31 mux C */
#define MUX_PD31C_AIC_IRQ                          _L_(2)       /**< AIC signal line function value: AIC_IRQ */
#define PIO_PD31C_AIC_IRQ                          (_U_(1) << 31) /**< AIC signal: AIC_IRQ */
/* ========== PIO definition for SAIC peripheral ========== */
#define PIN_PB4C_SAIC_FIQ                          _L_(36)      /**< SAIC signal: SAIC_FIQ on PB4 mux C */
#define MUX_PB4C_SAIC_FIQ                          _L_(2)       /**< SAIC signal line function value: SAIC_FIQ */
#define PIO_PB4C_SAIC_FIQ                          (_U_(1) << 4) /**< SAIC signal: SAIC_FIQ */
#define PIN_PC8C_SAIC_FIQ                          _L_(72)      /**< SAIC signal: SAIC_FIQ on PC8 mux C */
#define MUX_PC8C_SAIC_FIQ                          _L_(2)       /**< SAIC signal line function value: SAIC_FIQ */
#define PIO_PC8C_SAIC_FIQ                          (_U_(1) << 8) /**< SAIC signal: SAIC_FIQ */
#define PIN_PC9A_SAIC_FIQ                          _L_(73)      /**< SAIC signal: SAIC_FIQ on PC9 mux A */
#define MUX_PC9A_SAIC_FIQ                          _L_(0)       /**< SAIC signal line function value: SAIC_FIQ */
#define PIO_PC9A_SAIC_FIQ                          (_U_(1) << 9) /**< SAIC signal: SAIC_FIQ */
#define PIN_PD3B_SAIC_FIQ                          _L_(99)      /**< SAIC signal: SAIC_FIQ on PD3 mux B */
#define MUX_PD3B_SAIC_FIQ                          _L_(1)       /**< SAIC signal line function value: SAIC_FIQ */
#define PIO_PD3B_SAIC_FIQ                          (_U_(1) << 3) /**< SAIC signal: SAIC_FIQ */
/* ========== PIO definition for CLASSD peripheral ========== */
#define PIN_PA28F_CLASSD_L0                        _L_(28)      /**< CLASSD signal: CLASSD_L0 on PA28 mux F */
#define MUX_PA28F_CLASSD_L0                        _L_(5)       /**< CLASSD signal line function value: CLASSD_L0 */
#define PIO_PA28F_CLASSD_L0                        (_U_(1) << 28) /**< CLASSD signal: CLASSD_L0 */
#define PIN_PA29F_CLASSD_L1                        _L_(29)      /**< CLASSD signal: CLASSD_L1 on PA29 mux F */
#define MUX_PA29F_CLASSD_L1                        _L_(5)       /**< CLASSD signal line function value: CLASSD_L1 */
#define PIO_PA29F_CLASSD_L1                        (_U_(1) << 29) /**< CLASSD signal: CLASSD_L1 */
#define PIN_PA30F_CLASSD_L2                        _L_(30)      /**< CLASSD signal: CLASSD_L2 on PA30 mux F */
#define MUX_PA30F_CLASSD_L2                        _L_(5)       /**< CLASSD signal line function value: CLASSD_L2 */
#define PIO_PA30F_CLASSD_L2                        (_U_(1) << 30) /**< CLASSD signal: CLASSD_L2 */
#define PIN_PA31F_CLASSD_L3                        _L_(31)      /**< CLASSD signal: CLASSD_L3 on PA31 mux F */
#define MUX_PA31F_CLASSD_L3                        _L_(5)       /**< CLASSD signal line function value: CLASSD_L3 */
#define PIO_PA31F_CLASSD_L3                        (_U_(1) << 31) /**< CLASSD signal: CLASSD_L3 */
#define PIN_PB1F_CLASSD_R0                         _L_(33)      /**< CLASSD signal: CLASSD_R0 on PB1 mux F */
#define MUX_PB1F_CLASSD_R0                         _L_(5)       /**< CLASSD signal line function value: CLASSD_R0 */
#define PIO_PB1F_CLASSD_R0                         (_U_(1) << 1) /**< CLASSD signal: CLASSD_R0 */
#define PIN_PB2F_CLASSD_R1                         _L_(34)      /**< CLASSD signal: CLASSD_R1 on PB2 mux F */
#define MUX_PB2F_CLASSD_R1                         _L_(5)       /**< CLASSD signal line function value: CLASSD_R1 */
#define PIO_PB2F_CLASSD_R1                         (_U_(1) << 2) /**< CLASSD signal: CLASSD_R1 */
#define PIN_PB3F_CLASSD_R2                         _L_(35)      /**< CLASSD signal: CLASSD_R2 on PB3 mux F */
#define MUX_PB3F_CLASSD_R2                         _L_(5)       /**< CLASSD signal line function value: CLASSD_R2 */
#define PIO_PB3F_CLASSD_R2                         (_U_(1) << 3) /**< CLASSD signal: CLASSD_R2 */
#define PIN_PB4F_CLASSD_R3                         _L_(36)      /**< CLASSD signal: CLASSD_R3 on PB4 mux F */
#define MUX_PB4F_CLASSD_R3                         _L_(5)       /**< CLASSD signal line function value: CLASSD_R3 */
#define PIO_PB4F_CLASSD_R3                         (_U_(1) << 4) /**< CLASSD signal: CLASSD_R3 */
/* ========== PIO definition for FLEXCOM0 peripheral ========== */
#define PIN_PB28C_FLEXCOM0_IO0                     _L_(60)      /**< FLEXCOM0 signal: FLEXCOM0_IO0 on PB28 mux C */
#define MUX_PB28C_FLEXCOM0_IO0                     _L_(2)       /**< FLEXCOM0 signal line function value: FLEXCOM0_IO0 */
#define PIO_PB28C_FLEXCOM0_IO0                     (_U_(1) << 28) /**< FLEXCOM0 signal: FLEXCOM0_IO0 */
#define PIN_PB29C_FLEXCOM0_IO1                     _L_(61)      /**< FLEXCOM0 signal: FLEXCOM0_IO1 on PB29 mux C */
#define MUX_PB29C_FLEXCOM0_IO1                     _L_(2)       /**< FLEXCOM0 signal line function value: FLEXCOM0_IO1 */
#define PIO_PB29C_FLEXCOM0_IO1                     (_U_(1) << 29) /**< FLEXCOM0 signal: FLEXCOM0_IO1 */
#define PIN_PB30C_FLEXCOM0_IO2                     _L_(62)      /**< FLEXCOM0 signal: FLEXCOM0_IO2 on PB30 mux C */
#define MUX_PB30C_FLEXCOM0_IO2                     _L_(2)       /**< FLEXCOM0 signal line function value: FLEXCOM0_IO2 */
#define PIO_PB30C_FLEXCOM0_IO2                     (_U_(1) << 30) /**< FLEXCOM0 signal: FLEXCOM0_IO2 */
#define PIN_PB31C_FLEXCOM0_IO3                     _L_(63)      /**< FLEXCOM0 signal: FLEXCOM0_IO3 on PB31 mux C */
#define MUX_PB31C_FLEXCOM0_IO3                     _L_(2)       /**< FLEXCOM0 signal line function value: FLEXCOM0_IO3 */
#define PIO_PB31C_FLEXCOM0_IO3                     (_U_(1) << 31) /**< FLEXCOM0 signal: FLEXCOM0_IO3 */
#define PIN_PC0C_FLEXCOM0_IO4                      _L_(64)      /**< FLEXCOM0 signal: FLEXCOM0_IO4 on PC0 mux C */
#define MUX_PC0C_FLEXCOM0_IO4                      _L_(2)       /**< FLEXCOM0 signal line function value: FLEXCOM0_IO4 */
#define PIO_PC0C_FLEXCOM0_IO4                      (_U_(1) << 0) /**< FLEXCOM0 signal: FLEXCOM0_IO4 */
/* ========== PIO definition for FLEXCOM1 peripheral ========== */
#define PIN_PA24A_FLEXCOM1_IO0                     _L_(24)      /**< FLEXCOM1 signal: FLEXCOM1_IO0 on PA24 mux A */
#define MUX_PA24A_FLEXCOM1_IO0                     _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_IO0 */
#define PIO_PA24A_FLEXCOM1_IO0                     (_U_(1) << 24) /**< FLEXCOM1 signal: FLEXCOM1_IO0 */
#define PIN_PA23A_FLEXCOM1_IO1                     _L_(23)      /**< FLEXCOM1 signal: FLEXCOM1_IO1 on PA23 mux A */
#define MUX_PA23A_FLEXCOM1_IO1                     _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_IO1 */
#define PIO_PA23A_FLEXCOM1_IO1                     (_U_(1) << 23) /**< FLEXCOM1 signal: FLEXCOM1_IO1 */
#define PIN_PA22A_FLEXCOM1_IO2                     _L_(22)      /**< FLEXCOM1 signal: FLEXCOM1_IO2 on PA22 mux A */
#define MUX_PA22A_FLEXCOM1_IO2                     _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_IO2 */
#define PIO_PA22A_FLEXCOM1_IO2                     (_U_(1) << 22) /**< FLEXCOM1 signal: FLEXCOM1_IO2 */
#define PIN_PA25A_FLEXCOM1_IO3                     _L_(25)      /**< FLEXCOM1 signal: FLEXCOM1_IO3 on PA25 mux A */
#define MUX_PA25A_FLEXCOM1_IO3                     _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_IO3 */
#define PIO_PA25A_FLEXCOM1_IO3                     (_U_(1) << 25) /**< FLEXCOM1 signal: FLEXCOM1_IO3 */
#define PIN_PA26A_FLEXCOM1_IO4                     _L_(26)      /**< FLEXCOM1 signal: FLEXCOM1_IO4 on PA26 mux A */
#define MUX_PA26A_FLEXCOM1_IO4                     _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_IO4 */
#define PIO_PA26A_FLEXCOM1_IO4                     (_U_(1) << 26) /**< FLEXCOM1 signal: FLEXCOM1_IO4 */
/* ========== PIO definition for FLEXCOM2 peripheral ========== */
#define PIN_PA6E_FLEXCOM2_IO0                      _L_(6)       /**< FLEXCOM2 signal: FLEXCOM2_IO0 on PA6 mux E */
#define MUX_PA6E_FLEXCOM2_IO0                      _L_(4)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO0 */
#define PIO_PA6E_FLEXCOM2_IO0                      (_U_(1) << 6) /**< FLEXCOM2 signal: FLEXCOM2_IO0 */
#define PIN_PD26C_FLEXCOM2_IO0                     _L_(122)     /**< FLEXCOM2 signal: FLEXCOM2_IO0 on PD26 mux C */
#define MUX_PD26C_FLEXCOM2_IO0                     _L_(2)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO0 */
#define PIO_PD26C_FLEXCOM2_IO0                     (_U_(1) << 26) /**< FLEXCOM2 signal: FLEXCOM2_IO0 */
#define PIN_PA7E_FLEXCOM2_IO1                      _L_(7)       /**< FLEXCOM2 signal: FLEXCOM2_IO1 on PA7 mux E */
#define MUX_PA7E_FLEXCOM2_IO1                      _L_(4)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO1 */
#define PIO_PA7E_FLEXCOM2_IO1                      (_U_(1) << 7) /**< FLEXCOM2 signal: FLEXCOM2_IO1 */
#define PIN_PD27C_FLEXCOM2_IO1                     _L_(123)     /**< FLEXCOM2 signal: FLEXCOM2_IO1 on PD27 mux C */
#define MUX_PD27C_FLEXCOM2_IO1                     _L_(2)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO1 */
#define PIO_PD27C_FLEXCOM2_IO1                     (_U_(1) << 27) /**< FLEXCOM2 signal: FLEXCOM2_IO1 */
#define PIN_PA8E_FLEXCOM2_IO2                      _L_(8)       /**< FLEXCOM2 signal: FLEXCOM2_IO2 on PA8 mux E */
#define MUX_PA8E_FLEXCOM2_IO2                      _L_(4)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO2 */
#define PIO_PA8E_FLEXCOM2_IO2                      (_U_(1) << 8) /**< FLEXCOM2 signal: FLEXCOM2_IO2 */
#define PIN_PD28C_FLEXCOM2_IO2                     _L_(124)     /**< FLEXCOM2 signal: FLEXCOM2_IO2 on PD28 mux C */
#define MUX_PD28C_FLEXCOM2_IO2                     _L_(2)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO2 */
#define PIO_PD28C_FLEXCOM2_IO2                     (_U_(1) << 28) /**< FLEXCOM2 signal: FLEXCOM2_IO2 */
#define PIN_PA9E_FLEXCOM2_IO3                      _L_(9)       /**< FLEXCOM2 signal: FLEXCOM2_IO3 on PA9 mux E */
#define MUX_PA9E_FLEXCOM2_IO3                      _L_(4)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO3 */
#define PIO_PA9E_FLEXCOM2_IO3                      (_U_(1) << 9) /**< FLEXCOM2 signal: FLEXCOM2_IO3 */
#define PIN_PD29C_FLEXCOM2_IO3                     _L_(125)     /**< FLEXCOM2 signal: FLEXCOM2_IO3 on PD29 mux C */
#define MUX_PD29C_FLEXCOM2_IO3                     _L_(2)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO3 */
#define PIO_PD29C_FLEXCOM2_IO3                     (_U_(1) << 29) /**< FLEXCOM2 signal: FLEXCOM2_IO3 */
#define PIN_PA10E_FLEXCOM2_IO4                     _L_(10)      /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PA10 mux E */
#define MUX_PA10E_FLEXCOM2_IO4                     _L_(4)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PA10E_FLEXCOM2_IO4                     (_U_(1) << 10) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
#define PIN_PD30C_FLEXCOM2_IO4                     _L_(126)     /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PD30 mux C */
#define MUX_PD30C_FLEXCOM2_IO4                     _L_(2)       /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PD30C_FLEXCOM2_IO4                     (_U_(1) << 30) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
/* ========== PIO definition for FLEXCOM3 peripheral ========== */
#define PIN_PA15E_FLEXCOM3_IO0                     _L_(15)      /**< FLEXCOM3 signal: FLEXCOM3_IO0 on PA15 mux E */
#define MUX_PA15E_FLEXCOM3_IO0                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO0 */
#define PIO_PA15E_FLEXCOM3_IO0                     (_U_(1) << 15) /**< FLEXCOM3 signal: FLEXCOM3_IO0 */
#define PIN_PB23E_FLEXCOM3_IO0                     _L_(55)      /**< FLEXCOM3 signal: FLEXCOM3_IO0 on PB23 mux E */
#define MUX_PB23E_FLEXCOM3_IO0                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO0 */
#define PIO_PB23E_FLEXCOM3_IO0                     (_U_(1) << 23) /**< FLEXCOM3 signal: FLEXCOM3_IO0 */
#define PIN_PC20E_FLEXCOM3_IO0                     _L_(84)      /**< FLEXCOM3 signal: FLEXCOM3_IO0 on PC20 mux E */
#define MUX_PC20E_FLEXCOM3_IO0                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO0 */
#define PIO_PC20E_FLEXCOM3_IO0                     (_U_(1) << 20) /**< FLEXCOM3 signal: FLEXCOM3_IO0 */
#define PIN_PA13E_FLEXCOM3_IO1                     _L_(13)      /**< FLEXCOM3 signal: FLEXCOM3_IO1 on PA13 mux E */
#define MUX_PA13E_FLEXCOM3_IO1                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO1 */
#define PIO_PA13E_FLEXCOM3_IO1                     (_U_(1) << 13) /**< FLEXCOM3 signal: FLEXCOM3_IO1 */
#define PIN_PB22E_FLEXCOM3_IO1                     _L_(54)      /**< FLEXCOM3 signal: FLEXCOM3_IO1 on PB22 mux E */
#define MUX_PB22E_FLEXCOM3_IO1                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO1 */
#define PIO_PB22E_FLEXCOM3_IO1                     (_U_(1) << 22) /**< FLEXCOM3 signal: FLEXCOM3_IO1 */
#define PIN_PC19E_FLEXCOM3_IO1                     _L_(83)      /**< FLEXCOM3 signal: FLEXCOM3_IO1 on PC19 mux E */
#define MUX_PC19E_FLEXCOM3_IO1                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO1 */
#define PIO_PC19E_FLEXCOM3_IO1                     (_U_(1) << 19) /**< FLEXCOM3 signal: FLEXCOM3_IO1 */
#define PIN_PA14E_FLEXCOM3_IO2                     _L_(14)      /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PA14 mux E */
#define MUX_PA14E_FLEXCOM3_IO2                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PA14E_FLEXCOM3_IO2                     (_U_(1) << 14) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PB21E_FLEXCOM3_IO2                     _L_(53)      /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PB21 mux E */
#define MUX_PB21E_FLEXCOM3_IO2                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PB21E_FLEXCOM3_IO2                     (_U_(1) << 21) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PC18E_FLEXCOM3_IO2                     _L_(82)      /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PC18 mux E */
#define MUX_PC18E_FLEXCOM3_IO2                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PC18E_FLEXCOM3_IO2                     (_U_(1) << 18) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PA16E_FLEXCOM3_IO3                     _L_(16)      /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PA16 mux E */
#define MUX_PA16E_FLEXCOM3_IO3                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PA16E_FLEXCOM3_IO3                     (_U_(1) << 16) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PB24E_FLEXCOM3_IO3                     _L_(56)      /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PB24 mux E */
#define MUX_PB24E_FLEXCOM3_IO3                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PB24E_FLEXCOM3_IO3                     (_U_(1) << 24) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PC21E_FLEXCOM3_IO3                     _L_(85)      /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PC21 mux E */
#define MUX_PC21E_FLEXCOM3_IO3                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PC21E_FLEXCOM3_IO3                     (_U_(1) << 21) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PA17E_FLEXCOM3_IO4                     _L_(17)      /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PA17 mux E */
#define MUX_PA17E_FLEXCOM3_IO4                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PA17E_FLEXCOM3_IO4                     (_U_(1) << 17) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
#define PIN_PB25E_FLEXCOM3_IO4                     _L_(57)      /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PB25 mux E */
#define MUX_PB25E_FLEXCOM3_IO4                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PB25E_FLEXCOM3_IO4                     (_U_(1) << 25) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
#define PIN_PC22E_FLEXCOM3_IO4                     _L_(86)      /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PC22 mux E */
#define MUX_PC22E_FLEXCOM3_IO4                     _L_(4)       /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PC22E_FLEXCOM3_IO4                     (_U_(1) << 22) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
/* ========== PIO definition for FLEXCOM4 peripheral ========== */
#define PIN_PC28B_FLEXCOM4_IO0                     _L_(92)      /**< FLEXCOM4 signal: FLEXCOM4_IO0 on PC28 mux B */
#define MUX_PC28B_FLEXCOM4_IO0                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO0 */
#define PIO_PC28B_FLEXCOM4_IO0                     (_U_(1) << 28) /**< FLEXCOM4 signal: FLEXCOM4_IO0 */
#define PIN_PD12B_FLEXCOM4_IO0                     _L_(108)     /**< FLEXCOM4 signal: FLEXCOM4_IO0 on PD12 mux B */
#define MUX_PD12B_FLEXCOM4_IO0                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO0 */
#define PIO_PD12B_FLEXCOM4_IO0                     (_U_(1) << 12) /**< FLEXCOM4 signal: FLEXCOM4_IO0 */
#define PIN_PD21C_FLEXCOM4_IO0                     _L_(117)     /**< FLEXCOM4 signal: FLEXCOM4_IO0 on PD21 mux C */
#define MUX_PD21C_FLEXCOM4_IO0                     _L_(2)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO0 */
#define PIO_PD21C_FLEXCOM4_IO0                     (_U_(1) << 21) /**< FLEXCOM4 signal: FLEXCOM4_IO0 */
#define PIN_PC29B_FLEXCOM4_IO1                     _L_(93)      /**< FLEXCOM4 signal: FLEXCOM4_IO1 on PC29 mux B */
#define MUX_PC29B_FLEXCOM4_IO1                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO1 */
#define PIO_PC29B_FLEXCOM4_IO1                     (_U_(1) << 29) /**< FLEXCOM4 signal: FLEXCOM4_IO1 */
#define PIN_PD13B_FLEXCOM4_IO1                     _L_(109)     /**< FLEXCOM4 signal: FLEXCOM4_IO1 on PD13 mux B */
#define MUX_PD13B_FLEXCOM4_IO1                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO1 */
#define PIO_PD13B_FLEXCOM4_IO1                     (_U_(1) << 13) /**< FLEXCOM4 signal: FLEXCOM4_IO1 */
#define PIN_PD22C_FLEXCOM4_IO1                     _L_(118)     /**< FLEXCOM4 signal: FLEXCOM4_IO1 on PD22 mux C */
#define MUX_PD22C_FLEXCOM4_IO1                     _L_(2)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO1 */
#define PIO_PD22C_FLEXCOM4_IO1                     (_U_(1) << 22) /**< FLEXCOM4 signal: FLEXCOM4_IO1 */
#define PIN_PC30B_FLEXCOM4_IO2                     _L_(94)      /**< FLEXCOM4 signal: FLEXCOM4_IO2 on PC30 mux B */
#define MUX_PC30B_FLEXCOM4_IO2                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO2 */
#define PIO_PC30B_FLEXCOM4_IO2                     (_U_(1) << 30) /**< FLEXCOM4 signal: FLEXCOM4_IO2 */
#define PIN_PD14B_FLEXCOM4_IO2                     _L_(110)     /**< FLEXCOM4 signal: FLEXCOM4_IO2 on PD14 mux B */
#define MUX_PD14B_FLEXCOM4_IO2                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO2 */
#define PIO_PD14B_FLEXCOM4_IO2                     (_U_(1) << 14) /**< FLEXCOM4 signal: FLEXCOM4_IO2 */
#define PIN_PD23C_FLEXCOM4_IO2                     _L_(119)     /**< FLEXCOM4 signal: FLEXCOM4_IO2 on PD23 mux C */
#define MUX_PD23C_FLEXCOM4_IO2                     _L_(2)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO2 */
#define PIO_PD23C_FLEXCOM4_IO2                     (_U_(1) << 23) /**< FLEXCOM4 signal: FLEXCOM4_IO2 */
#define PIN_PC31B_FLEXCOM4_IO3                     _L_(95)      /**< FLEXCOM4 signal: FLEXCOM4_IO3 on PC31 mux B */
#define MUX_PC31B_FLEXCOM4_IO3                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO3 */
#define PIO_PC31B_FLEXCOM4_IO3                     (_U_(1) << 31) /**< FLEXCOM4 signal: FLEXCOM4_IO3 */
#define PIN_PD15B_FLEXCOM4_IO3                     _L_(111)     /**< FLEXCOM4 signal: FLEXCOM4_IO3 on PD15 mux B */
