virtualabs/cutcutgo/src/packs/ATSAMA5D27CLD2G_DFP/pio/sama5d27cld2g.h
#define MUX_PD15B_FLEXCOM4_IO3                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO3 */
#define PIO_PD15B_FLEXCOM4_IO3                     (_U_(1) << 15) /**< FLEXCOM4 signal: FLEXCOM4_IO3 */
#define PIN_PD24C_FLEXCOM4_IO3                     _L_(120)     /**< FLEXCOM4 signal: FLEXCOM4_IO3 on PD24 mux C */
#define MUX_PD24C_FLEXCOM4_IO3                     _L_(2)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO3 */
#define PIO_PD24C_FLEXCOM4_IO3                     (_U_(1) << 24) /**< FLEXCOM4 signal: FLEXCOM4_IO3 */
#define PIN_PD0B_FLEXCOM4_IO4                      _L_(96)      /**< FLEXCOM4 signal: FLEXCOM4_IO4 on PD0 mux B */
#define MUX_PD0B_FLEXCOM4_IO4                      _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO4 */
#define PIO_PD0B_FLEXCOM4_IO4                      (_U_(1) << 0) /**< FLEXCOM4 signal: FLEXCOM4_IO4 */
#define PIN_PD16B_FLEXCOM4_IO4                     _L_(112)     /**< FLEXCOM4 signal: FLEXCOM4_IO4 on PD16 mux B */
#define MUX_PD16B_FLEXCOM4_IO4                     _L_(1)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO4 */
#define PIO_PD16B_FLEXCOM4_IO4                     (_U_(1) << 16) /**< FLEXCOM4 signal: FLEXCOM4_IO4 */
#define PIN_PD25C_FLEXCOM4_IO4                     _L_(121)     /**< FLEXCOM4 signal: FLEXCOM4_IO4 on PD25 mux C */
#define MUX_PD25C_FLEXCOM4_IO4                     _L_(2)       /**< FLEXCOM4 signal line function value: FLEXCOM4_IO4 */
#define PIO_PD25C_FLEXCOM4_IO4                     (_U_(1) << 25) /**< FLEXCOM4 signal: FLEXCOM4_IO4 */
/* ========== PIO definition for GMAC peripheral ========== */
#define PIN_PB9F_GMAC_GCOL                         _L_(41)      /**< GMAC signal: GMAC_GCOL on PB9 mux F */
#define MUX_PB9F_GMAC_GCOL                         _L_(5)       /**< GMAC signal line function value: GMAC_GCOL */
#define PIO_PB9F_GMAC_GCOL                         (_U_(1) << 9) /**< GMAC signal: GMAC_GCOL */
#define PIN_PC23B_GMAC_GCOL                        _L_(87)      /**< GMAC signal: GMAC_GCOL on PC23 mux B */
#define MUX_PC23B_GMAC_GCOL                        _L_(1)       /**< GMAC signal line function value: GMAC_GCOL */
#define PIO_PC23B_GMAC_GCOL                        (_U_(1) << 23) /**< GMAC signal: GMAC_GCOL */
#define PIN_PD4D_GMAC_GCOL                         _L_(100)     /**< GMAC signal: GMAC_GCOL on PD4 mux D */
#define MUX_PD4D_GMAC_GCOL                         _L_(3)       /**< GMAC signal line function value: GMAC_GCOL */
#define PIO_PD4D_GMAC_GCOL                         (_U_(1) << 4) /**< GMAC signal: GMAC_GCOL */
#define PIN_PB8F_GMAC_GCRS                         _L_(40)      /**< GMAC signal: GMAC_GCRS on PB8 mux F */
#define MUX_PB8F_GMAC_GCRS                         _L_(5)       /**< GMAC signal line function value: GMAC_GCRS */
#define PIO_PB8F_GMAC_GCRS                         (_U_(1) << 8) /**< GMAC signal: GMAC_GCRS */
#define PIN_PC22B_GMAC_GCRS                        _L_(86)      /**< GMAC signal: GMAC_GCRS on PC22 mux B */
#define MUX_PC22B_GMAC_GCRS                        _L_(1)       /**< GMAC signal line function value: GMAC_GCRS */
#define PIO_PC22B_GMAC_GCRS                        (_U_(1) << 22) /**< GMAC signal: GMAC_GCRS */
#define PIN_PD3D_GMAC_GCRS                         _L_(99)      /**< GMAC signal: GMAC_GCRS on PD3 mux D */
#define MUX_PD3D_GMAC_GCRS                         _L_(3)       /**< GMAC signal line function value: GMAC_GCRS */
#define PIO_PD3D_GMAC_GCRS                         (_U_(1) << 3) /**< GMAC signal: GMAC_GCRS */
#define PIN_PB22F_GMAC_GMDC                        _L_(54)      /**< GMAC signal: GMAC_GMDC on PB22 mux F */
#define MUX_PB22F_GMAC_GMDC                        _L_(5)       /**< GMAC signal line function value: GMAC_GMDC */
#define PIO_PB22F_GMAC_GMDC                        (_U_(1) << 22) /**< GMAC signal: GMAC_GMDC */
#define PIN_PC18B_GMAC_GMDC                        _L_(82)      /**< GMAC signal: GMAC_GMDC on PC18 mux B */
#define MUX_PC18B_GMAC_GMDC                        _L_(1)       /**< GMAC signal line function value: GMAC_GMDC */
#define PIO_PC18B_GMAC_GMDC                        (_U_(1) << 18) /**< GMAC signal: GMAC_GMDC */
#define PIN_PD17D_GMAC_GMDC                        _L_(113)     /**< GMAC signal: GMAC_GMDC on PD17 mux D */
#define MUX_PD17D_GMAC_GMDC                        _L_(3)       /**< GMAC signal line function value: GMAC_GMDC */
#define PIO_PD17D_GMAC_GMDC                        (_U_(1) << 17) /**< GMAC signal: GMAC_GMDC */
#define PIN_PB23F_GMAC_GMDIO                       _L_(55)      /**< GMAC signal: GMAC_GMDIO on PB23 mux F */
#define MUX_PB23F_GMAC_GMDIO                       _L_(5)       /**< GMAC signal line function value: GMAC_GMDIO */
#define PIO_PB23F_GMAC_GMDIO                       (_U_(1) << 23) /**< GMAC signal: GMAC_GMDIO */
#define PIN_PC19B_GMAC_GMDIO                       _L_(83)      /**< GMAC signal: GMAC_GMDIO on PC19 mux B */
#define MUX_PC19B_GMAC_GMDIO                       _L_(1)       /**< GMAC signal line function value: GMAC_GMDIO */
#define PIO_PC19B_GMAC_GMDIO                       (_U_(1) << 19) /**< GMAC signal: GMAC_GMDIO */
#define PIN_PD18D_GMAC_GMDIO                       _L_(114)     /**< GMAC signal: GMAC_GMDIO on PD18 mux D */
#define MUX_PD18D_GMAC_GMDIO                       _L_(3)       /**< GMAC signal line function value: GMAC_GMDIO */
#define PIO_PD18D_GMAC_GMDIO                       (_U_(1) << 18) /**< GMAC signal: GMAC_GMDIO */
#define PIN_PB18F_GMAC_GRX0                        _L_(50)      /**< GMAC signal: GMAC_GRX0 on PB18 mux F */
#define MUX_PB18F_GMAC_GRX0                        _L_(5)       /**< GMAC signal line function value: GMAC_GRX0 */
#define PIO_PB18F_GMAC_GRX0                        (_U_(1) << 18) /**< GMAC signal: GMAC_GRX0 */
#define PIN_PC14B_GMAC_GRX0                        _L_(78)      /**< GMAC signal: GMAC_GRX0 on PC14 mux B */
#define MUX_PC14B_GMAC_GRX0                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX0 */
#define PIO_PC14B_GMAC_GRX0                        (_U_(1) << 14) /**< GMAC signal: GMAC_GRX0 */
#define PIN_PD13D_GMAC_GRX0                        _L_(109)     /**< GMAC signal: GMAC_GRX0 on PD13 mux D */
#define MUX_PD13D_GMAC_GRX0                        _L_(3)       /**< GMAC signal line function value: GMAC_GRX0 */
#define PIO_PD13D_GMAC_GRX0                        (_U_(1) << 13) /**< GMAC signal: GMAC_GRX0 */
#define PIN_PB19F_GMAC_GRX1                        _L_(51)      /**< GMAC signal: GMAC_GRX1 on PB19 mux F */
#define MUX_PB19F_GMAC_GRX1                        _L_(5)       /**< GMAC signal line function value: GMAC_GRX1 */
#define PIO_PB19F_GMAC_GRX1                        (_U_(1) << 19) /**< GMAC signal: GMAC_GRX1 */
#define PIN_PC15B_GMAC_GRX1                        _L_(79)      /**< GMAC signal: GMAC_GRX1 on PC15 mux B */
#define MUX_PC15B_GMAC_GRX1                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX1 */
#define PIO_PC15B_GMAC_GRX1                        (_U_(1) << 15) /**< GMAC signal: GMAC_GRX1 */
#define PIN_PD14D_GMAC_GRX1                        _L_(110)     /**< GMAC signal: GMAC_GRX1 on PD14 mux D */
#define MUX_PD14D_GMAC_GRX1                        _L_(3)       /**< GMAC signal line function value: GMAC_GRX1 */
#define PIO_PD14D_GMAC_GRX1                        (_U_(1) << 14) /**< GMAC signal: GMAC_GRX1 */
#define PIN_PB10F_GMAC_GRX2                        _L_(42)      /**< GMAC signal: GMAC_GRX2 on PB10 mux F */
#define MUX_PB10F_GMAC_GRX2                        _L_(5)       /**< GMAC signal line function value: GMAC_GRX2 */
#define PIO_PB10F_GMAC_GRX2                        (_U_(1) << 10) /**< GMAC signal: GMAC_GRX2 */
#define PIN_PC24B_GMAC_GRX2                        _L_(88)      /**< GMAC signal: GMAC_GRX2 on PC24 mux B */
#define MUX_PC24B_GMAC_GRX2                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX2 */
#define PIO_PC24B_GMAC_GRX2                        (_U_(1) << 24) /**< GMAC signal: GMAC_GRX2 */
#define PIN_PD5D_GMAC_GRX2                         _L_(101)     /**< GMAC signal: GMAC_GRX2 on PD5 mux D */
#define MUX_PD5D_GMAC_GRX2                         _L_(3)       /**< GMAC signal line function value: GMAC_GRX2 */
#define PIO_PD5D_GMAC_GRX2                         (_U_(1) << 5) /**< GMAC signal: GMAC_GRX2 */
#define PIN_PB11F_GMAC_GRX3                        _L_(43)      /**< GMAC signal: GMAC_GRX3 on PB11 mux F */
#define MUX_PB11F_GMAC_GRX3                        _L_(5)       /**< GMAC signal line function value: GMAC_GRX3 */
#define PIO_PB11F_GMAC_GRX3                        (_U_(1) << 11) /**< GMAC signal: GMAC_GRX3 */
#define PIN_PC25B_GMAC_GRX3                        _L_(89)      /**< GMAC signal: GMAC_GRX3 on PC25 mux B */
#define MUX_PC25B_GMAC_GRX3                        _L_(1)       /**< GMAC signal line function value: GMAC_GRX3 */
#define PIO_PC25B_GMAC_GRX3                        (_U_(1) << 25) /**< GMAC signal: GMAC_GRX3 */
#define PIN_PD6D_GMAC_GRX3                         _L_(102)     /**< GMAC signal: GMAC_GRX3 on PD6 mux D */
#define MUX_PD6D_GMAC_GRX3                         _L_(3)       /**< GMAC signal line function value: GMAC_GRX3 */
#define PIO_PD6D_GMAC_GRX3                         (_U_(1) << 6) /**< GMAC signal: GMAC_GRX3 */
#define PIN_PB7F_GMAC_GRXCK                        _L_(39)      /**< GMAC signal: GMAC_GRXCK on PB7 mux F */
#define MUX_PB7F_GMAC_GRXCK                        _L_(5)       /**< GMAC signal line function value: GMAC_GRXCK */
#define PIO_PB7F_GMAC_GRXCK                        (_U_(1) << 7) /**< GMAC signal: GMAC_GRXCK */
#define PIN_PC20B_GMAC_GRXCK                       _L_(84)      /**< GMAC signal: GMAC_GRXCK on PC20 mux B */
#define MUX_PC20B_GMAC_GRXCK                       _L_(1)       /**< GMAC signal line function value: GMAC_GRXCK */
#define PIO_PC20B_GMAC_GRXCK                       (_U_(1) << 20) /**< GMAC signal: GMAC_GRXCK */
#define PIN_PD1D_GMAC_GRXCK                        _L_(97)      /**< GMAC signal: GMAC_GRXCK on PD1 mux D */
#define MUX_PD1D_GMAC_GRXCK                        _L_(3)       /**< GMAC signal line function value: GMAC_GRXCK */
#define PIO_PD1D_GMAC_GRXCK                        (_U_(1) << 1) /**< GMAC signal: GMAC_GRXCK */
#define PIN_PB16F_GMAC_GRXDV                       _L_(48)      /**< GMAC signal: GMAC_GRXDV on PB16 mux F */
#define MUX_PB16F_GMAC_GRXDV                       _L_(5)       /**< GMAC signal line function value: GMAC_GRXDV */
#define PIO_PB16F_GMAC_GRXDV                       (_U_(1) << 16) /**< GMAC signal: GMAC_GRXDV */
#define PIN_PC12B_GMAC_GRXDV                       _L_(76)      /**< GMAC signal: GMAC_GRXDV on PC12 mux B */
#define MUX_PC12B_GMAC_GRXDV                       _L_(1)       /**< GMAC signal line function value: GMAC_GRXDV */
#define PIO_PC12B_GMAC_GRXDV                       (_U_(1) << 12) /**< GMAC signal: GMAC_GRXDV */
#define PIN_PD11D_GMAC_GRXDV                       _L_(107)     /**< GMAC signal: GMAC_GRXDV on PD11 mux D */
#define MUX_PD11D_GMAC_GRXDV                       _L_(3)       /**< GMAC signal line function value: GMAC_GRXDV */
#define PIO_PD11D_GMAC_GRXDV                       (_U_(1) << 11) /**< GMAC signal: GMAC_GRXDV */
#define PIN_PB17F_GMAC_GRXER                       _L_(49)      /**< GMAC signal: GMAC_GRXER on PB17 mux F */
#define MUX_PB17F_GMAC_GRXER                       _L_(5)       /**< GMAC signal line function value: GMAC_GRXER */
#define PIO_PB17F_GMAC_GRXER                       (_U_(1) << 17) /**< GMAC signal: GMAC_GRXER */
#define PIN_PC13B_GMAC_GRXER                       _L_(77)      /**< GMAC signal: GMAC_GRXER on PC13 mux B */
#define MUX_PC13B_GMAC_GRXER                       _L_(1)       /**< GMAC signal line function value: GMAC_GRXER */
#define PIO_PC13B_GMAC_GRXER                       (_U_(1) << 13) /**< GMAC signal: GMAC_GRXER */
#define PIN_PD12D_GMAC_GRXER                       _L_(108)     /**< GMAC signal: GMAC_GRXER on PD12 mux D */
#define MUX_PD12D_GMAC_GRXER                       _L_(3)       /**< GMAC signal line function value: GMAC_GRXER */
#define PIO_PD12D_GMAC_GRXER                       (_U_(1) << 12) /**< GMAC signal: GMAC_GRXER */
#define PIN_PB5F_GMAC_GTSUCOMP                     _L_(37)      /**< GMAC signal: GMAC_GTSUCOMP on PB5 mux F */
#define MUX_PB5F_GMAC_GTSUCOMP                     _L_(5)       /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PB5F_GMAC_GTSUCOMP                     (_U_(1) << 5) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PC9B_GMAC_GTSUCOMP                     _L_(73)      /**< GMAC signal: GMAC_GTSUCOMP on PC9 mux B */
#define MUX_PC9B_GMAC_GTSUCOMP                     _L_(1)       /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PC9B_GMAC_GTSUCOMP                     (_U_(1) << 9) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PD0D_GMAC_GTSUCOMP                     _L_(96)      /**< GMAC signal: GMAC_GTSUCOMP on PD0 mux D */
#define MUX_PD0D_GMAC_GTSUCOMP                     _L_(3)       /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PD0D_GMAC_GTSUCOMP                     (_U_(1) << 0) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PB20F_GMAC_GTX0                        _L_(52)      /**< GMAC signal: GMAC_GTX0 on PB20 mux F */
#define MUX_PB20F_GMAC_GTX0                        _L_(5)       /**< GMAC signal line function value: GMAC_GTX0 */
#define PIO_PB20F_GMAC_GTX0                        (_U_(1) << 20) /**< GMAC signal: GMAC_GTX0 */
#define PIN_PC16B_GMAC_GTX0                        _L_(80)      /**< GMAC signal: GMAC_GTX0 on PC16 mux B */
#define MUX_PC16B_GMAC_GTX0                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX0 */
#define PIO_PC16B_GMAC_GTX0                        (_U_(1) << 16) /**< GMAC signal: GMAC_GTX0 */
#define PIN_PD15D_GMAC_GTX0                        _L_(111)     /**< GMAC signal: GMAC_GTX0 on PD15 mux D */
#define MUX_PD15D_GMAC_GTX0                        _L_(3)       /**< GMAC signal line function value: GMAC_GTX0 */
#define PIO_PD15D_GMAC_GTX0                        (_U_(1) << 15) /**< GMAC signal: GMAC_GTX0 */
#define PIN_PB21F_GMAC_GTX1                        _L_(53)      /**< GMAC signal: GMAC_GTX1 on PB21 mux F */
#define MUX_PB21F_GMAC_GTX1                        _L_(5)       /**< GMAC signal line function value: GMAC_GTX1 */
#define PIO_PB21F_GMAC_GTX1                        (_U_(1) << 21) /**< GMAC signal: GMAC_GTX1 */
#define PIN_PC17B_GMAC_GTX1                        _L_(81)      /**< GMAC signal: GMAC_GTX1 on PC17 mux B */
#define MUX_PC17B_GMAC_GTX1                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX1 */
#define PIO_PC17B_GMAC_GTX1                        (_U_(1) << 17) /**< GMAC signal: GMAC_GTX1 */
#define PIN_PD16D_GMAC_GTX1                        _L_(112)     /**< GMAC signal: GMAC_GTX1 on PD16 mux D */
#define MUX_PD16D_GMAC_GTX1                        _L_(3)       /**< GMAC signal line function value: GMAC_GTX1 */
#define PIO_PD16D_GMAC_GTX1                        (_U_(1) << 16) /**< GMAC signal: GMAC_GTX1 */
#define PIN_PB12F_GMAC_GTX2                        _L_(44)      /**< GMAC signal: GMAC_GTX2 on PB12 mux F */
#define MUX_PB12F_GMAC_GTX2                        _L_(5)       /**< GMAC signal line function value: GMAC_GTX2 */
#define PIO_PB12F_GMAC_GTX2                        (_U_(1) << 12) /**< GMAC signal: GMAC_GTX2 */
#define PIN_PC26B_GMAC_GTX2                        _L_(90)      /**< GMAC signal: GMAC_GTX2 on PC26 mux B */
#define MUX_PC26B_GMAC_GTX2                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX2 */
#define PIO_PC26B_GMAC_GTX2                        (_U_(1) << 26) /**< GMAC signal: GMAC_GTX2 */
#define PIN_PD7D_GMAC_GTX2                         _L_(103)     /**< GMAC signal: GMAC_GTX2 on PD7 mux D */
#define MUX_PD7D_GMAC_GTX2                         _L_(3)       /**< GMAC signal line function value: GMAC_GTX2 */
#define PIO_PD7D_GMAC_GTX2                         (_U_(1) << 7) /**< GMAC signal: GMAC_GTX2 */
#define PIN_PB13F_GMAC_GTX3                        _L_(45)      /**< GMAC signal: GMAC_GTX3 on PB13 mux F */
#define MUX_PB13F_GMAC_GTX3                        _L_(5)       /**< GMAC signal line function value: GMAC_GTX3 */
#define PIO_PB13F_GMAC_GTX3                        (_U_(1) << 13) /**< GMAC signal: GMAC_GTX3 */
#define PIN_PC27B_GMAC_GTX3                        _L_(91)      /**< GMAC signal: GMAC_GTX3 on PC27 mux B */
#define MUX_PC27B_GMAC_GTX3                        _L_(1)       /**< GMAC signal line function value: GMAC_GTX3 */
#define PIO_PC27B_GMAC_GTX3                        (_U_(1) << 27) /**< GMAC signal: GMAC_GTX3 */
#define PIN_PD8D_GMAC_GTX3                         _L_(104)     /**< GMAC signal: GMAC_GTX3 on PD8 mux D */
#define MUX_PD8D_GMAC_GTX3                         _L_(3)       /**< GMAC signal line function value: GMAC_GTX3 */
#define PIO_PD8D_GMAC_GTX3                         (_U_(1) << 8) /**< GMAC signal: GMAC_GTX3 */
#define PIN_PB14F_GMAC_GTXCK                       _L_(46)      /**< GMAC signal: GMAC_GTXCK on PB14 mux F */
#define MUX_PB14F_GMAC_GTXCK                       _L_(5)       /**< GMAC signal line function value: GMAC_GTXCK */
#define PIO_PB14F_GMAC_GTXCK                       (_U_(1) << 14) /**< GMAC signal: GMAC_GTXCK */
#define PIN_PC10B_GMAC_GTXCK                       _L_(74)      /**< GMAC signal: GMAC_GTXCK on PC10 mux B */
#define MUX_PC10B_GMAC_GTXCK                       _L_(1)       /**< GMAC signal line function value: GMAC_GTXCK */
#define PIO_PC10B_GMAC_GTXCK                       (_U_(1) << 10) /**< GMAC signal: GMAC_GTXCK */
#define PIN_PD9D_GMAC_GTXCK                        _L_(105)     /**< GMAC signal: GMAC_GTXCK on PD9 mux D */
#define MUX_PD9D_GMAC_GTXCK                        _L_(3)       /**< GMAC signal line function value: GMAC_GTXCK */
#define PIO_PD9D_GMAC_GTXCK                        (_U_(1) << 9) /**< GMAC signal: GMAC_GTXCK */
#define PIN_PB15F_GMAC_GTXEN                       _L_(47)      /**< GMAC signal: GMAC_GTXEN on PB15 mux F */
#define MUX_PB15F_GMAC_GTXEN                       _L_(5)       /**< GMAC signal line function value: GMAC_GTXEN */
#define PIO_PB15F_GMAC_GTXEN                       (_U_(1) << 15) /**< GMAC signal: GMAC_GTXEN */
#define PIN_PC11B_GMAC_GTXEN                       _L_(75)      /**< GMAC signal: GMAC_GTXEN on PC11 mux B */
#define MUX_PC11B_GMAC_GTXEN                       _L_(1)       /**< GMAC signal line function value: GMAC_GTXEN */
#define PIO_PC11B_GMAC_GTXEN                       (_U_(1) << 11) /**< GMAC signal: GMAC_GTXEN */
#define PIN_PD10D_GMAC_GTXEN                       _L_(106)     /**< GMAC signal: GMAC_GTXEN on PD10 mux D */
#define MUX_PD10D_GMAC_GTXEN                       _L_(3)       /**< GMAC signal line function value: GMAC_GTXEN */
#define PIO_PD10D_GMAC_GTXEN                       (_U_(1) << 10) /**< GMAC signal: GMAC_GTXEN */
#define PIN_PB6F_GMAC_GTXER                        _L_(38)      /**< GMAC signal: GMAC_GTXER on PB6 mux F */
#define MUX_PB6F_GMAC_GTXER                        _L_(5)       /**< GMAC signal line function value: GMAC_GTXER */
#define PIO_PB6F_GMAC_GTXER                        (_U_(1) << 6) /**< GMAC signal: GMAC_GTXER */
#define PIN_PC21B_GMAC_GTXER                       _L_(85)      /**< GMAC signal: GMAC_GTXER on PC21 mux B */
#define MUX_PC21B_GMAC_GTXER                       _L_(1)       /**< GMAC signal line function value: GMAC_GTXER */
#define PIO_PC21B_GMAC_GTXER                       (_U_(1) << 21) /**< GMAC signal: GMAC_GTXER */
#define PIN_PD2D_GMAC_GTXER                        _L_(98)      /**< GMAC signal: GMAC_GTXER on PD2 mux D */
#define MUX_PD2D_GMAC_GTXER                        _L_(3)       /**< GMAC signal line function value: GMAC_GTXER */
#define PIO_PD2D_GMAC_GTXER                        (_U_(1) << 2) /**< GMAC signal: GMAC_GTXER */
/* ========== PIO definition for I2SC0 peripheral ========== */
#define PIN_PC1E_I2SC0_CK                          _L_(65)      /**< I2SC0 signal: I2SC0_CK on PC1 mux E */
#define MUX_PC1E_I2SC0_CK                          _L_(4)       /**< I2SC0 signal line function value: I2SC0_CK */
#define PIO_PC1E_I2SC0_CK                          (_U_(1) << 1) /**< I2SC0 signal: I2SC0_CK */
#define PIN_PD19E_I2SC0_CK                         _L_(115)     /**< I2SC0 signal: I2SC0_CK on PD19 mux E */
#define MUX_PD19E_I2SC0_CK                         _L_(4)       /**< I2SC0 signal line function value: I2SC0_CK */
#define PIO_PD19E_I2SC0_CK                         (_U_(1) << 19) /**< I2SC0 signal: I2SC0_CK */
#define PIN_PC4E_I2SC0_DI0                         _L_(68)      /**< I2SC0 signal: I2SC0_DI0 on PC4 mux E */
#define MUX_PC4E_I2SC0_DI0                         _L_(4)       /**< I2SC0 signal line function value: I2SC0_DI0 */
#define PIO_PC4E_I2SC0_DI0                         (_U_(1) << 4) /**< I2SC0 signal: I2SC0_DI0 */
#define PIN_PD22E_I2SC0_DI0                        _L_(118)     /**< I2SC0 signal: I2SC0_DI0 on PD22 mux E */
#define MUX_PD22E_I2SC0_DI0                        _L_(4)       /**< I2SC0 signal line function value: I2SC0_DI0 */
#define PIO_PD22E_I2SC0_DI0                        (_U_(1) << 22) /**< I2SC0 signal: I2SC0_DI0 */
#define PIN_PC5E_I2SC0_DO0                         _L_(69)      /**< I2SC0 signal: I2SC0_DO0 on PC5 mux E */
#define MUX_PC5E_I2SC0_DO0                         _L_(4)       /**< I2SC0 signal line function value: I2SC0_DO0 */
#define PIO_PC5E_I2SC0_DO0                         (_U_(1) << 5) /**< I2SC0 signal: I2SC0_DO0 */
#define PIN_PD23E_I2SC0_DO0                        _L_(119)     /**< I2SC0 signal: I2SC0_DO0 on PD23 mux E */
#define MUX_PD23E_I2SC0_DO0                        _L_(4)       /**< I2SC0 signal line function value: I2SC0_DO0 */
#define PIO_PD23E_I2SC0_DO0                        (_U_(1) << 23) /**< I2SC0 signal: I2SC0_DO0 */
#define PIN_PC2E_I2SC0_MCK                         _L_(66)      /**< I2SC0 signal: I2SC0_MCK on PC2 mux E */
#define MUX_PC2E_I2SC0_MCK                         _L_(4)       /**< I2SC0 signal line function value: I2SC0_MCK */
#define PIO_PC2E_I2SC0_MCK                         (_U_(1) << 2) /**< I2SC0 signal: I2SC0_MCK */
#define PIN_PD20E_I2SC0_MCK                        _L_(116)     /**< I2SC0 signal: I2SC0_MCK on PD20 mux E */
#define MUX_PD20E_I2SC0_MCK                        _L_(4)       /**< I2SC0 signal line function value: I2SC0_MCK */
#define PIO_PD20E_I2SC0_MCK                        (_U_(1) << 20) /**< I2SC0 signal: I2SC0_MCK */
#define PIN_PC3E_I2SC0_WS                          _L_(67)      /**< I2SC0 signal: I2SC0_WS on PC3 mux E */
#define MUX_PC3E_I2SC0_WS                          _L_(4)       /**< I2SC0 signal line function value: I2SC0_WS */
#define PIO_PC3E_I2SC0_WS                          (_U_(1) << 3) /**< I2SC0 signal: I2SC0_WS */
#define PIN_PD21E_I2SC0_WS                         _L_(117)     /**< I2SC0 signal: I2SC0_WS on PD21 mux E */
#define MUX_PD21E_I2SC0_WS                         _L_(4)       /**< I2SC0 signal line function value: I2SC0_WS */
#define PIO_PD21E_I2SC0_WS                         (_U_(1) << 21) /**< I2SC0 signal: I2SC0_WS */
/* ========== PIO definition for I2SC1 peripheral ========== */
#define PIN_PA15D_I2SC1_CK                         _L_(15)      /**< I2SC1 signal: I2SC1_CK on PA15 mux D */
#define MUX_PA15D_I2SC1_CK                         _L_(3)       /**< I2SC1 signal line function value: I2SC1_CK */
#define PIO_PA15D_I2SC1_CK                         (_U_(1) << 15) /**< I2SC1 signal: I2SC1_CK */
#define PIN_PB15D_I2SC1_CK                         _L_(47)      /**< I2SC1 signal: I2SC1_CK on PB15 mux D */
#define MUX_PB15D_I2SC1_CK                         _L_(3)       /**< I2SC1 signal line function value: I2SC1_CK */
